In [1]:
import pandas as pd


data_frame = pd.read_csv('titles.csv', delimiter=',')

print(data_frame) # output with function 'print'
data_frame # output without function 'print'

                           title           author  year
0  The Weirdstone of Brisingamen      Alan Garner  1960
1         Perdido Street Station   China Mieville  2000
2                          Thud!  Terry Pratchett  2005
3                   The Spellmam         LisaLutz  2007
4                     Small Gods  Terry Pratchett  1992

                           title           author  year
0  The Weirdstone of Brisingamen      Alan Garner  1960
1         Perdido Street Station   China Mieville  2000
2                          Thud!  Terry Pratchett  2005
3                   The Spellmam         LisaLutz  2007
4                     Small Gods  Terry Pratchett  1992

In [14]:
n = 2

In [15]:
data_frame.head(n) # n строк с начала

                           title          author  year
0  The Weirdstone of Brisingamen     Alan Garner  1960
1         Perdido Street Station  China Mieville  2000

In [16]:
data_frame.tail(n) # n строк с конца

          title           author  year
3  The Spellmam         LisaLutz  2007
4    Small Gods  Terry Pratchett  1992

In [17]:
data_frame.sample(n) # случайная строка (цифра в скобках показывает сколько строк)

                    title           author  year
4              Small Gods  Terry Pratchett  1992
1  Perdido Street Station   China Mieville  2000

In [18]:
data_frame[['title', 'year']]

                           title  year
0  The Weirdstone of Brisingamen  1960
1         Perdido Street Station  2000
2                          Thud!  2005
3                   The Spellmam  2007
4                     Small Gods  1992

In [19]:
data_frame[data_frame.year >= 2000]

                    title           author  year
1  Perdido Street Station   China Mieville  2000
2                   Thud!  Terry Pratchett  2005
3            The Spellmam         LisaLutz  2007

In [20]:
data_frame[['title', 'author']].head(n) # функции выполняются по-очереди, сначала поиск столбцов 'title', 'author', потом вывод n элементов сверху

                           title          author
0  The Weirdstone of Brisingamen     Alan Garner
1         Perdido Street Station  China Mieville